import { Culture, Detail, SubCarousel, Support } from '../_types/contentSection.types';

export const details: Detail[] = [
  {
    title: '누구나 가진 몰입의 힘을 믿습니다',
    content:
      '만약 누군가의 몰입이 없었다면, 모두를 위한 새로운 혁신은 없었을 것입니다.<br/>토스커뮤니티에서는 누구나 각자의 방식으로 몰입할 수 있습니다.',
    blocks: [
      {
        blockHeader: 'Direct Responsible Individual',
        blockTitle: '모두가 맡은 바에<br/>최종 의사결정할 수 있습니다.',
        blockContent:
          '탁월한 역량과 도덕성을 함께 갖춘 전문가를 동료로 모십니다. 전문가보다 의사결정을 더 잘할 수 있는 사람은 없다고 믿습니다.<br/><br/>맡은 일에 대한 DRI(Direct Responsible Individual, 최종의사결정권)를 바탕으로 모든 것을 스스로 결정하고 주도적으로 진행하며, 결과에 대한 책임을 집니다.<br/><br/>결과에 따른 신뢰 확장을 통해 DRI로 내릴 수 있는 일의 범위도 점차 확장시킬 수 있습니다.',
      },
      {
        blockHeader: 'Freedom & Responsibility',
        blockTitle: '자율과 책임으로<br/>일합니다.',
        blockContent:
          '팀원을 믿지 못해 만든 규칙과 프로세스를 최소화합니다. 자율을 악용하지 않을 도덕성이 높은 동료만 모시기에 가능한 일입니다.<br/><br/>이 덕분에 업무의 대부분은 자율과 책임의 환경에서 진행되며, 팀원들 모두가 더욱 몰입해서 일할 수 있습니다.<br/><br/>서로 간의 신뢰를 더욱 높이기 위한 노력은 매일 계속되고 있습니다.',
      },
      {
        blockHeader: 'Radical Transparency',
        blockTitle: '정보는 모두에게<br/>열려있습니다.',
        blockContent:
          '전문가로서 최적의 의사결정을 하기 위해선 누구나 필요한 정보에 접근할 수 있어야 합니다.<br/><br/>의사결정에 필요한 최대한의 정보를 팀 전체에 공개하고 있으며, 접근하기 힘든 정보가 있다면 접근성을 높이기 위해서 노력합니다.<br/><br/>정보의 비대칭은 불합리한 권력과 불필요한 정치를 만듭니다. 토스커뮤니티에서는 이러한 것들이 없으며, 팀원 모두가 동일한 수준의 정보 위에서 일할 수 있습니다.',
      },
      {
        blockHeader: 'Courage to Fail Fast',
        blockTitle: '용기 있는 빠른 실패를 통해<br/>성장합니다.',
        blockContent:
          '실패를 두려워하지 않는 마음은 성공으로 가는 지름길입니다. 처음부터 성공하고 싶은 마음이 들수록 실패하더라도 더 빨리 시도해보기 위한 용기와 담대함을 갖고자 노력합니다.<br/><br/>더 빨리 실패를 선언하고, 그 실패에서 배운 러닝을 통해 다음을 향해 용기 있게 나아가는 것에 언제나 박수를 쳐줍니다.',
      },
    ],
    carousel: [
      {
        carouselContent:
          '토스커뮤니티의 모든 분들이 느끼는 점일텐데요, 일에 방해되는 불필요한 절차나 형식적인 문화가 거의 없는 곳이 바로 토스커뮤니티입니다. 업무나 역할에 크게 제한이 없는 것 또한 큰 장점이라, 이런 환경 속에서 자신이 그려나가는 바를 마음껏 실현시켜 나가면 되는 문화예요.',
        name: 'Head of Communications, 윤기열 님',
      },
      {
        carouselContent:
          '힘든 점이요? 벤치마킹할 곳이 많지 않다는 점이요.<br/>‘아무도 가지 않은 길’을 가는 느낌이랄까요.<br/>그런데 시행착오를 겪으며 배우는 것이 더 많아요.',
        name: 'Design Strategy Lead, 강수영 님',
      },
      {
        carouselContent:
          '모든 정보가 100% 투명하게 공개되고 있어요. 이에 따라 제가 속한 사일로와 챕터가 지향해야 하는 일의 방향도 직접 결정할 수 있습니다. 토스커뮤니티가 지향하는 목표와 일의 우선순위를 고려해, 궁극적으로 팀 전체에 도움되는 방향으로 제품을 만들 수 있는 환경이죠.',
        name: 'Head of Technology, 박준하 님',
      },
      {
        carouselContent:
          '새로운 도구를 하나 만들고 나면 운영 모드로 전환됩니다. 하지만 이때 더 나은 방법을 한번 더 고민해봐요. ‘더 자동화할 수 없을까?‘, ‘더 효율적으로 사용할 수 있는 방법은 없을까?’ 운영 모드로 전환되더라도 일이 끊임없이 재미있는 이유죠.',
        name: 'Data Service Team Leader, 유승민 님',
      },
    ],
  },
  {
    title: '탁월한 동료들이 함께합니다',
    content: '공동의 목표를 향해 함께 달릴 준비가 된,<br/>훌륭한 동료들이 곁에 있습니다.',
    blocks: [
      {
        blockHeader: 'Mission over Individual',
        blockTitle: '팀을 위한 일이<br/>최우선 순위가 됩니다.',
        blockContent:
          '일을 하다 보면 우선순위를 정할 때 고민되는 상황이 생기기 마련입니다. 이때 토스커뮤니티에서는 팀의 목표에 가장 큰 영향을 줄 수 있는 일이 최우선 순위가 됩니다.<br/><br/>지금 당신이 맡은 일이 팀에 가장 필요한 일이라면, 동료들은 언제라도 두 팔 걷고 함께할 준비가 되어 있습니다.',
      },
      {
        blockHeader: 'Learn Proactively',
        blockTitle: '주도적으로 학습합니다.',
        blockContent:
          '가장 좋은 학습의 수단은 옆에 있는 ‘동료’입니다. 업무에 관련한 지식, 좋은 판단 등 회사의 정보를 다양한 루트를 통해서 주도적으로 학습하고 흡수합니다.<br/><br/>내가 무엇을 모르는지 명확히 인지하여 객관적으로 판단하고, 그것을 채우기 위해서 내가 모르는 점을 주변에 용기 있게 드러내는 것을 권장합니다.',
      },
      {
        blockHeader: 'Radical Candor',
        blockTitle: '동료간에는 ‘완전한 솔직함’을<br/>추구합니다.',
        blockContent:
          '동료와 의견이 다른 상황에서 솔직하게 말하면 기분 나쁘지 않을까 걱정되는 순간이 있습니다. 하지만 갈등이 두려워 피드백을 전하지 못한다면, 더 나은 해결책을 찾기 어렵습니다.<br/><br/>동료가 성장하길 바라는 마음을 바탕으로 개선점을 솔직하게 말하며, 최선이 아닌 최고의 결과물을 만들어 내는데 집중합니다.',
      },
      {
        blockHeader: 'High Performance Culture',
        blockTitle: '높은 퍼포먼스 문화를<br/>추구합니다.',
        blockContent:
          '토스커뮤니티 문화의 목표는 지속적으로 승리하는 팀을 만드는 것입니다. 이를 위해서 높은 탁월함을 추구합니다.<br/><br/>함께 일하는 동료의 역량에 끊임없이 자극을 받고, 의견을 나누며 논의를 발전시킬 수 있습니다.<br/><br/>이러한 흐름을 강화할수록 토스의 승리는 많아질 것이며, 이로 얻은 더 많은 결실을 팀원들과 나누기 위해 노력합니다.',
      },
    ],
    carousel: [
      {
        carouselContent:
          '한 번은 작업을 하다 실수를 하는 바람에 오류가 생겼어요.<br/>이럴 때 토스팀에서는 문제에 책임질 사람을 찾기보다 문제 해결에 더 집중해요.<br/>저를 나무라기보단 동료들이 먼저 ‘위축되지 말고 지금처럼 업무를 적극적으로 해달라’는 피드백을 줬어요. 실패에서 배우고 더 성장하는 토스팀 만의 문화 덕분이라고 생각해요.',
        name: 'Security Engineer, 홍용진 님',
      },
      {
        carouselContent:
          '토스는 하나의 서비스를 출시한 후 안주하는 조직이 아닙니다.<br/>‘이런 기능이 들어가면 고객들이 더 편하지 않을까?’ 를 끊임없이 고민하며, 부족한 점을 빠르게 개선하는 애자일 조직이거든요. 이런 환경에서 기존의 방법을 고수하기보다, 팀의 속도에 발맞춰 유연하게 리서치를 운영하는 것이 훨씬 효과적입니다.',
        name: 'UX Researcher, 김서연 님',
      },
      {
        carouselContent:
          '이전 직장에서 무섭고 힘들었던 점은, ‘내일, 한 달, 1년 후의 나에게 확신을 가질 수 있는가?’ 라는 질문에 답을 내릴 수 없었다는 건데요. 토스커뮤니티에서는 미래의 나에게 확신을 가질 수 있습니다. 프로답게 일하는 것이 요구되는 토스커뮤니티에서는, 몸은 지칠 수 있지만 매일 성장하고 있다 확신할 수 있어요. ‘프로다움‘이 주는 힘듦과 자부심이죠.',
        name: 'Internal Product Developer, 최승일 님',
      },
      {
        carouselContent:
          '결과물에 대해 챌린지하는 용기를 적극 장려합니다. 보통 업무의 결과물에 자아를 투영할 수밖에 없게 되잖아요. 그래서 “이렇게 하면 더 좋지 않을까요?” 라는 이야기 자체를 꺼내거나 듣는 것에 방어적일 수밖에 없게 되는데, 토스커뮤니티에는 피드백을 장려하는 문화가 기저에 깔려있기 때문에 건강한 대화가 오가는 것이 정말 좋아요.',
        name: 'Head of UX, 정희연 님',
      },
    ],
  },
  {
    title: '일의 본질에 집중할 수 있는<br/>문화를 만들고 있습니다',
    content:
      '토스커뮤니티는 완전히 새로운 조직 문화를 지향합니다.<br/>세상에 없던 제품과 서비스를 선보이려면, 새로운 문화가 바탕이 되어야 한다고 믿습니다.',
    blocks: [
      {
        blockHeader: 'Question Every Assumption',
        blockTitle: '모든 가정에 근원적인 물음을 제기합니다.',
        blockContent:
          '‘당연한 것’은 없습니다. 토스의 역사도 ‘당연한 것’에 물음표를 던지며 시작되었습니다.<br/><br/>현재 상황에서 이미 기본적으로 가정하고 실행하는 안이라도, 그것이 바뀌면 어떨지를 생각해 봅니다. 이를 통해 더 나은 길을 끊임없이 추구할 수 있습니다.',
      },
      {
        blockHeader: 'Focus on Impact',
        blockTitle: '가장 큰 임팩트를<br/>만들 수 있는 일에 집중합니다.',
        blockContent:
          '지금 해결해야 하는, 가장 중요한 일에만 집중하면 됩니다. 나중에 해도 되는 일은 우선순위를 뒤로 배정해 리소스를 낭비하지 않도록 합니다.<br/><br/>꼭 필요한 일이 아니라면 과감히 생략하고, 가장 큰 임팩트를 만들 수 있는 일을 먼저합니다. 임팩트는 토스커뮤니티가 가장 중시하는 가치 중 하나입니다.',
      },
      {
        blockHeader: 'Move with Urgency',
        blockTitle: '신속한 속도로 움직입니다.',
        blockContent:
          '새로운 혁신은 고객의 새로운 최소 기준이 됩니다. 때문에 느리게 움직여서 기회를 잃는 것보다 신속한 속도로 시도하고 실패하는 것이 언제나 나은 선택입니다.<br/><br/>팀원들은 주변 동료의 속도감을 높여주는 데에 필요한 것들을 받쳐주고 도와주면서, 팀 전체가 신속한 업무 리듬을 유지하고 강화하는 것을 지향합니다.',
      },
      {
        blockHeader: 'Go the Extra-mile',
        blockTitle: '좋은 것을 넘어<br/>위대한 것을 추구합니다.',
        blockContent:
          '토스커뮤니티는 적당한 수준에서 일을 마무리 짓지 않습니다. 목표를 달성한 후에도 그것을 개선하고 더 큰 성과를 만들어 내기 위한 방법을 찾습니다.<br/><br/>이는 몰입이 끊임없이 지속되는 이유 중 하나이며, 토스커뮤니티에서의 목표 달성은 새로운 몰입의 시작으로 이어집니다.',
      },
    ],
    carousel: [
      {
        carouselContent:
          '토스커뮤니티에서는 연차가 아닌 팀원들에게 받는 ‘신뢰’로 리더가 결정됩니다. 신뢰는 모든 팀원들에게 중시되는 가치인데요. 재택 근무나 무제한 휴가 같은 제도가 이에서 시작된다고 생각해요. 동료 간의 신뢰는 물론, 회사가 팀원 한 명, 한 명에게 가지는 신뢰가 느껴지는 이 문화가 정말 좋아요.',
        name: 'FR Team Leader, 류리나 님',
      },
      {
        carouselContent:
          '다른 팀에 업무를 부탁하면 하루 만에 해결됩니다.<br/>“제가 더 도와드릴 것 없을까요?” 라며 물어봐주시고요. 이런 사람들이 많다는 것이 가장 큰 차이점이자 매력인 것 같아요. 모두가 하나의 목표를 보고 함께 달리고 있으며, 팀 성장에 도움되는 일이라면 망설임 없이 적극적으로 도와주시니까요.',
        name: 'DevOps Engineer, 최명규 님',
      },
      {
        carouselContent:
          '3배 빨리 일하고, 5배 더 몰입할 수 있는 환경 속에서 많은 것을 해볼 수 있습니다. 그만큼 러닝 커브가 가파르기 때문에, 커리어의 정점을 찍을 수 있는 곳이라 확신해요. 일을 잘하면 기회도 더 많이 주어집니다. 제 역할을 증명하기 위해 애쓰지 않아도, 열심히 할수록 신뢰가 자연스레 쌓이는 조직이에요.',
        name: 'Product Owner, 김성아 님',
      },
      {
        carouselContent:
          '일하다 궁금한 점이 있을 때, 주변 동료분에게 여쭤보면 5초 만에 답변이 와요.<br/>토스팀에 필요한 일이라 생각하면, 원래 하던 일을 잠시 멈추더라도 적극적으로 도와주시거든요. 멋진 동료들에게 많은 도움을 받고 있기 때문에, 저도 그런 동료가 되기 위해 항상 노력하고 있어요.',
        name: 'Data Product Owner, 김경두 님',
      },
    ],
  },
];

export const culture: Culture = {
  title: '일하는 문화를 새롭게<br/>만들고 있습니다',
  content:
    '토스커뮤니티는 완전히 새로운 조직 문화를 지향합니다.<br/>세상에 없던 제품과 서비스를 선보이려면, 새로운 문화가 바탕이 되어야 한다고 믿습니다.',
};

export const support: Support = {
  title: '몰입하는 당신을 위한,<br/>아낌 없는 보상과 지원',
  blocks: [
    {
      blockTitle: '자율적인 근무 환경에서<br/>효율적인 업무가 가능합니다',
      blockContent:
        '유연한 출퇴근 시간<br/>원격 근무 가능<br/>별도 승인 없는 자율 휴가<br/>근속 3년마다 리프레시 유급 휴가 1개월',
    },
    {
      blockTitle: '업무와 성장에<br/>몰두할 수 있도록 지원합니다',
      blockContent:
        '업계 최고 수준의 연봉<br/>반기별 성과급 지급<br/>개인 법인카드 지급 (식대, 야근교통비 등에 자율 사용)<br/>도서, 워크샵, 세미나 등 업무 교육비 100% 지원<br/>최고급 하드웨어 및 업무용 소프트웨어 제공',
    },
    {
      blockTitle: '사소한 것까지<br/>회사가 책임집니다',
      blockContent:
        '1억 무이자 주택자금 대출(토스씨엑스 및 토스인슈어런스 제외)<br/>전문 바리스타가 운영하는 사내 카페<br/>전문 미용사가 상주하는 사내 헤어살롱<br/>다양한 간식과 물품이 상시 구비되어 있는 사내 편의점<br/>직장단체보험 (가족 포함) 및 각종 경조사비 지원<br/>매월 체력단련비, 통신비 지원',
    },
  ],
};

export const subCarousel: SubCarousel = {
  title: '토스커뮤니티 복지 자세히 보기',
  carousel: [
    {
      carouselTitle: '1억 무이자 주택자금 대출(토스씨엑스 및 토스인슈어런스 제외)',
      carouselContent:
        ' 토스커뮤니티 모두가 주거 걱정 없이 일할 수 있도록, 최대 1억 원의 주택자금 대출을 무이자로 받을 수 있습니다.',
    },
    {
      carouselTitle: '자율 휴가',
      carouselContent:
        '토스에서 휴가의 핵심은 승인이 아닌 공유입니다. 자율과 신뢰를 기반으로 별도의 보고나 승인 없이 자유롭게 휴가를 사용할 수 있습니다.',
    },
    {
      carouselTitle: '사내 편의점',
      carouselContent:
        '언제나 열려있는 무인 편의점에서 다양한 간식부터 각종 비상약품, 문구류까지 모두 무료로 이용 가능합니다.',
    },
    {
      carouselTitle: '사내 카페',
      carouselContent:
        '토스 사내 카페 ‘커피 사일로(Coffee Silo)’는 모든 팀원들이 가장 즐겨찾는 공간입니다. 하루의 시작을 도와주는 활력소가 되어주는 것은 물론, 지칠 때 쉬어갈 수 있는 티타임을 준비해 주시기도 합니다.',
    },
    {
      carouselTitle: '자율 출퇴근제',
      carouselContent:
        '당신의 업무 스타일에 따라 직접 근무 시간 및 장소(출근 또는 원격 등)를 자유롭게 조정할 수 있습니다.',
    },
    {
      carouselTitle: '업무 집중 공간',
      carouselContent:
        '아무런 방해 없이 일에만 집중하고 싶을 때, 혼자 만의 공간을 활용할 수 있습니다. 사무실 곳곳에 오픈형이 아닌 벽으로 분리된 자리, 방음이 잘 되는 폰부스 등이 마련되어 있습니다.',
    },
  ],
};
